ОперативныеЗадачиФиниш/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиФиниш/src/AccumulationRegisters/СвободныеОстатки/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Количество() = 0 Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МенеджерВТ") = Ложь Тогда
	
		Возврат;
	
	КонецЕсли;
	
	//Ссылка = Отбор.Получить(0).Значение;
	Ссылка = Отбор.Регистратор.Значение;
    МенеджерВТ = ДополнительныеСвойства.МенеджерВТ;
	
		Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстатки.Количество КАК Количество
		|ПОМЕСТИТЬ ВТПередЗаписью
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
		|ГДЕ
		|	СвободныеОстатки.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если Количество() = 0 Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МенеджерВТ") = Ложь Тогда
	
		Возврат;
	
	КонецЕсли;
	
	//Ссылка = Отбор.Получить(0).Значение;
	Ссылка = Отбор.Регистратор.Значение;
    МенеджерВТ = ДополнительныеСвойства.МенеджерВТ;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстатки.Количество КАК Количество
		|ПОМЕСТИТЬ ВТПослеЗаписи
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
		|ГДЕ
		|	СвободныеОстатки.Регистратор = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПередЗаписью.Номенклатура,
		|	-1 * ВТПередЗаписью.Количество
		|ИЗ
		|	ВТПередЗаписью КАК ВТПередЗаписью
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПослеЗаписи.Номенклатура КАК Номенклатура,
		|	СУММА(ВТПослеЗаписи.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТТоварыДокумента
		|ИЗ
		|	ВТПослеЗаписи КАК ВТПослеЗаписи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПослеЗаписи.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТПослеЗаписи.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПередЗаписью
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПослеЗаписи";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Выполнить();
	
	
КонецПроцедуры
